{
    "quote": "\"I love what I do, so I do it best\".",
    "name": "OTMAN KHARBOUCH",
    "PROFILE": "PROFILE",
    "ABOUT": "ABOUT",
    "PROJECTS":"PROJECTS",
    "EXPERIENCES":"EXPERIENCES",
    "SERVICES":"SERVICES",
    "STATS":"STATS",
    "CONTACT":"CONTACT",
    "profession": "MERN Stack Developer",
    "description": "I am a MERN Stack Developer with a passion for creating beautiful and functional web applications. I have experience in building full-stack applications using JavaScript, React, Node.js, and Express.js. I am always looking for new opportunities to learn and grow as a developer.",
    "technos": "Technologies",
    "more": "SEE MORE",
    "about": "About",
    "about-me": "About Me :",
    "about-text": "Otman Kharbouch, a versatile full-stack web developer, proficient in building robust web applications using both the MERN stack and the PHP Laravel & Vue.js stack. Passionate about embracing new technologies and continuously expanding my skillset, I am always eager to learn and grow. I am a team player with excellent communication skills and a strong work ethic. I am looking for new opportunities to work on exciting projects and collaborate with other developers.",
    "education": "Education :",
    "education1-title": "Full-Stack Web Development Certificate : 2023-2025",
    "education1-description1": "YouCode is an inclusive school focused on individual-centered learning and teamwork. \"You\" represents the person, and \"Code\" stands for development. More info at <a href=\"https://youcode.ma\" target=\"_blank\" class=\"link-prm\"   >Youcode.ma</a >",
    "education2-title":"Auto-formation in Web Development : 2022",
    "education2-description1":"I completed online courses in web development, including FreeCodeCamp's Responsive Web Design and Codecademy's JavaScript and MongoDB, enhancing my skills in HTML, CSS, JavaScript, and MongoDB.",
    "education3-title":"Scientific Baccalaureate - Physics and Chemistry : 2021-2022",
    "education-description":"I completed my high school education with a scientific baccalaureate in physics and chemistry, which helped me develop my analytical and problem-solving skills.",
    "technologies":"Technologies :",
    "tech-count":"64+ technologies",
    "projects":"Projects",
    "p1-date":"April 2024",
    "p1-context":"This project was completed in 1 month and served as the final assignment for YouCode's first year",
    "visit-project":"Visit Project",
    "visit-repo":"Visit Repository",
    "p1-name": "QuickTable",
    "p1-description":"This solution allows users to easily book tables at cafes and restaurants directly from the menu, helping businesses efficiently manage reservations and optimize table occupancy.",
    "p2-name": "Hint",
    "p2-date":"Octobre 2024",
    "p2-context":"This project was built in 1 week by a team of 4 developers.",
    "p2-description":"Hint is a blog platform for Youcode students to share articles, discuss topics, and interact with each other—all through a user-friendly interface.",
    "p3-name": "Ixo-Multiplayer",
    "p3-date":"Octobre 2024",
    "p3-context":"This is a minimalistic game, made in 3 days as an introduction to NodeJS.",
    "p3-description":"Ixo-Multiplayer is an online game where two players compete on a 20x20 grid, aiming to align 5 'X' or 'O' symbols horizontally, vertically, or diagonally while blocking their opponent.",
    "p4-name": "Auth API",
    "p4-date":"September 2024",
    "p4-context":"This is part of a larger project developed for a delivery service called AlloMedia.",
    "p4-description":"A RESTful API built with Node.js and Express.js for user authentication and authorization, using JWT tokens to secure routes. It connects to a MongoDB database to securely store user data.",
    "more-projects":"See more",
    "exp":"Experience",
    "exp1":"Cegedim - Internship",
    "exp1-date":"April 2025 - July 2025",
    "exp1-description":"Cegedim is a global tech and services group specializing in healthcare,  data management, and CRM solutions for life sciences, insurers, and  healthcare professionals.",
    "exp-contributions":"Contributions:",
    "exp1-contributions": "<p>- Maintained and enhanced an existing project during my internship at Cegedim.</p><p>- Improved overall security by identifying and resolving key vulnerabilities.</p><p>- Enhanced UI/UX for a more intuitive and user-friendly interface.</p><p>- Contributed to stability and performance optimizations through refactoring.</p><p>- Collaborated with the team to ensure secure and scalable code practices.</p>",
    "exp2":"Moussasoft - Internship",
    "exp2-date":"May 2024 - July 2024",
    "exp2-description":"Moussasoft is a Moroccan IT company specializing in web and mobile development, digital solutions, and custom software tailored for businesses to enhance their digital presence and operational efficiency.",
    "exp2-contributions": "<p>- Contributed to website development by implementing requested changes and fixing bugs.</p><p>- Responsible for deploying tested and stable versions to production.</p><p>- Led a small development team, coordinating tasks and ensuring deadlines.</p><p>- Ensured code quality and version control across all updates.</p>",
    "exp-visit":"Visit their website",
    "exp-stack":"Tech stack :",
    "exp-note":"I've also completed various freelance projects, which I prefer not to list due to client confidentiality and personal discretion.",
    "services":"Services",
    "s1":"Logo Graphic design",
    "s2":"UX/UI Web-Design + Mobile Design",
    "s3":"Front-end development",
    "s4":"Front-end development by Framework",
    "s5":"Mobile Front-end development",
    "s6":"Back-end development ( Native )",
    "s7":"Back-end development by framework",
    "s8":"Database conception & management",
    "s9":"DevOps & Cloud Services",
    "services-tech":"Technologies :",
    "stats": "Stats",
    "github-stats":"GitHub Stats :",
    "account-overview":"Account Overview",
    "account-username":"Othman4dev",
    "total-commit":"Total commits :",
    "commit-count":"6,8k",
    "total-repos":"Repositories count :",
    "repos-count":"85",
    "total-followers":"Followers :",
    "followers-count":"26",
    "total-stars":"Stars :",
    "stars-count":"76",
    "commit-graph":"Commits Graph",
    "more-stats":"More Stats :",
    "contact":"Contact",
    "contact-big":"Feel free to contact me",
    "contact-small":"I respond immediately !",
    "linkedin:":"LinkedIn :",
    "email":"Email :",
    "contact-name": "Otman Kharbouch",
    "copy-email":"Copy Email",
    "whatsapp":"WhatsApp :",
    "start-chat":"Start a chat",
    "github":"GitHub :",
    "visit-profile":"Visit Profile",
    "instagram":"Instagram :",
    "copy":"2025 Otman Kharbouch. All rights reserved. Designed and developed by Otman Kharbouch.",
    "youcode":"YouCode",
    "education1-date":"2023 - 2025",
    "education1-description":"<strong>YouCode</strong> is a transformative two-year web development program that blends front-end and back-end training with soft skills like teamwork and project management. Partnered with UM6P and inspired by the Simplon.co model, it adopts a project-based learning approach to tackle real-world challenges. <br /> Supported by OCP and connected to the 1337 network, <strong>YouCode</strong> offers access to cutting-edge resources in a dynamic environment. Students graduate as confident, industry-ready professionals, equipped for future tech leadership.",
    "education-program":"Program of Study :",
    "education1-program-description":"At YouCode, the curriculum is designed to provide a comprehensive foundation in both front-end and back-end web development, along with essential tools and methodologies for modern software development.",
    "education1-learn":"Learn more about <strong>YouCode</strong> at",
    "tech-tools":"Technologies and Tools :",
    "education1-list":"<li>  Front-End Development: HTML, CSS, JavaScript, React, Angular,  Vue.js, Next.js, React Native.</li><li>Back-End Development: PHP, Laravel, Nest.js, ExpressJs</li><li>Databases: MongoDB, MySQL, DynamoDB</li><li>Web Servers: Apache, Nginx.</li><li>Operating Systems and Scripting: Linux, Bash, CMD.</li><li>Project Management: Jira, Trello</li><li>  Development Practices: Agile methodologies, version control  (Git/GitHub)</li>",
    "education1-final":"By engaging with this diverse stack, students graduate as versatile developers equipped to tackle real-world challenges and adapt to the ever-changing tech landscape.",
    "education2-title2":"E-learning",
    "education2-date":"2023 - 2021",
    "education2-description":"<strong>Codecademy</strong> and <strong>FreeCodeCamp</strong> are leading platforms in the realm of e-learning, offering comprehensive courses in web development and programming. These platforms provide a flexible and accessible way to learn coding skills, catering to both beginners and advanced learners. <br /> <strong>Codecademy</strong> offers interactive coding lessons in various programming languages, including JavaScript, Python, and HTML/CSS. Their hands-on approach ensures that learners can immediately apply what they learn through practical exercises and projects. <br /> <strong>FreeCodeCamp</strong> is renowned for its extensive curriculum that covers front-end and back-end development. It emphasizes project-based learning, allowing students to build real-world applications and gain practical experience. The platform also offers certifications upon completion of its rigorous courses.",
    "education2-learn":"<span>Learn more about <strong>Codecademy</strong> at</span> <a href=\"https://www.codecademy.com\" target=\"_blank\">Codecademy</a> and <strong>FreeCodeCamp</strong> at <a href=\"https://www.freecodecamp.org\" target=\"_blank\">FreeCodeCamp</a>",
    "education2-program-description":"The curriculum for the Responsive Web Design course on FreeCodeCamp and the JavaScript course on Codecademy is designed to provide a solid foundation in web development and programming.",
    "education2-list":"<div class=\"wrap-list\"><h3 class=\"education-subtitle\">FreeCodeCamp - Responsive Web Design </h3><ul class=\"education-list\"><li>Basic HTML and HTML5</li><li>Basic CSS</li><li>Applied Visual Design</li><li>Applied Accessibility</li><li>Responsive Web Design Principles</li><li>CSS Flexbox</li><li>CSS Grid</li><li>Responsive Web Design Projects</li>   </ul> </div> <div class=\"wrap-list\">   <h3 class=\"education-subtitle\">Codecademy - JavaScript</h3><ul class=\"education-list\"><li>Introduction to JavaScript</li><li>JavaScript Syntax</li><li>Functions</li><li>Conditionals, Arrays, Loops, Iterators, Objects, Scope</li><li>Classes</li><li>Browser Compatibility and Transpilation</li><li>JavaScript Projects</li></ul></div>",
    "education-final":"By engaging with these comprehensive courses, students gain the skills needed to build responsive websites and develop proficiency in JavaScript programming.",
    "loading":"Loading",
    "dev":"Under development",
    "dev-desc":"This website is continuously <strong>under development</strong>. Some features may be incomplete or not yet optimized for all devices. We appreciate your patience and understanding.",
    "dev-tip":"For the best experience, please use a <strong>computer</strong> or a <strong>tablet</strong>.",
    "tuto-1":"You can navigate using these arrows",
    "skip-all":"Skip all ",
    "next":"Next ",
    "cv":"Download CV",
    "lang":"Language",
    "offline":"Offline",
    "unavailable":"Currently unavailable"
}