{
    "quote": "\"J'aime ce que je fais, alors je le fais au mieux\".",
    "name": "OTMAN KHARBOUCH",
    "PROFILE": "PROFIL",
    "ABOUT": "À PROPOS",
    "PROJECTS":"PROJETS",
    "EXPERIENCES":"EXPÉRIENCES",
    "SERVICES":"SERVICES",
    "STATS":"STATISTIQUES",
    "CONTACT":"CONTACT",
    "profession": "Développeur MERN Stack",
    "description": "Je suis un développeur MERN Stack passionné par la création d'applications web belles et fonctionnelles. J'ai de l'expérience dans la construction d'applications full-stack utilisant JavaScript, React, Node.js et Express.js. Je recherche toujours de nouvelles opportunités d'apprendre et de grandir en tant que développeur.",
    "technos": "Technologies",
    "more": "VOIR PLUS",
    "about": "À propos",
    "about-me": "À propos de moi :",
    "about-text": "Otman Kharbouch, un développeur web full-stack polyvalent, compétent dans la construction d'applications web robustes utilisant à la fois la pile MERN et la pile PHP Laravel & Vue.js. Passionné par l'adoption de nouvelles technologies et l'expansion continue de mes compétences, je suis toujours désireux d'apprendre et de grandir. Je suis un joueur d'équipe avec d'excellentes compétences en communication et une forte éthique de travail. Je recherche de nouvelles opportunités pour travailler sur des projets passionnants et collaborer avec d'autres développeurs.",
    "education": "Formation :",
    "education1-title": "Certificat de Développement Web Full-Stack : 2023-2025",
    "education1-description1": "YouCode est une école inclusive axée sur l'apprentissage centré sur l'individu et le travail d'équipe. \"You\" représente la personne, et \"Code\" signifie développement. Plus d'infos sur <a href=\"https://youcode.ma\" target=\"_blank\" class=\"link-prm\"   >Youcode.ma</a >",
    "education2-title":"Auto-formation en Développement Web : 2022",
    "education2-description1":"J'ai terminé des cours en ligne en développement web, notamment le Responsive Web Design de FreeCodeCamp et les cours JavaScript et MongoDB de Codecademy, améliorant mes compétences en HTML, CSS, JavaScript et MongoDB.",
    "education3-title":"Baccalauréat Scientifique - Physique et Chimie : 2021-2022",
    "education-description":"J'ai terminé mes études secondaires avec un baccalauréat scientifique en physique et chimie, ce qui m'a aidé à développer mes compétences analytiques et de résolution de problèmes.",
    "technologies":"Technologies :",
    "tech-count":"64+ technologies",
    "projects":"Projets",
    "p1-date":"Avril 2024",
    "p1-context":"Ce projet a été réalisé en 1 mois et a servi de projet final pour la première année de YouCode",
    "visit-project":"Visiter le Projet",
    "visit-repo":"Visiter le Dépôt",
    "p1-name": "QuickTable",
    "p1-description":"Cette solution permet aux utilisateurs de réserver facilement des tables dans les cafés et restaurants directement depuis le menu, aidant les entreprises à gérer efficacement les réservations et optimiser l'occupation des tables.",
    "p2-name": "Hint",
    "p2-date":"Octobre 2024",
    "p2-context":"Ce projet a été construit en 1 semaine par une équipe de 4 développeurs.",
    "p2-description":"Hint est une plateforme de blog pour les étudiants Youcode pour partager des articles, discuter de sujets et interagir entre eux—le tout à travers une interface conviviale.",
    "p3-name": "Ixo-Multiplayer",
    "p3-date":"Octobre 2024",
    "p3-context":"C'est un jeu minimaliste, créé en 3 jours comme introduction à NodeJS.",
    "p3-description":"Ixo-Multiplayer est un jeu en ligne où deux joueurs s'affrontent sur une grille 20x20, visant à aligner 5 symboles 'X' ou 'O' horizontalement, verticalement ou diagonalement tout en bloquant leur adversaire.",
    "p4-name": "Auth API",
    "p4-date":"Septembre 2024",
    "p4-context":"Ceci fait partie d'un projet plus large développé pour un service de livraison appelé AlloMedia.",
    "p4-description":"Une API RESTful construite avec Node.js et Express.js pour l'authentification et l'autorisation des utilisateurs, utilisant des tokens JWT pour sécuriser les routes. Elle se connecte à une base de données MongoDB pour stocker en sécurité les données utilisateur.",
    "more-projects":"Voir plus",
    "exp":"Expérience",
    "exp1":"Cegedim - Stage",
    "exp1-date":"Avril 2025 - Juillet 2025",
    "exp1-description":"Cegedim est un groupe mondial de technologie et services spécialisé dans la santé et les solutions CRM pour les assureurs et les professionnels de santé.",
    "exp-contributions":"Contributions :",
    "exp1-contributions": "<p>- Maintenu et amélioré un projet existant durant mon stage chez Cegedim.</p><p>- Amélioré la sécurité globale en identifiant et résolvant les vulnérabilités clés.</p><p>- Amélioré l'UI/UX pour une interface plus intuitive et conviviale.</p><p>- Contribué aux optimisations de stabilité et performance par la refactorisation.</p><p>- Collaboré avec l'équipe pour assurer des pratiques de code sécurisées et évolutives.</p>",
    "exp2":"Moussasoft - Stage",
    "exp2-date":"Mai 2024 - Juillet 2024",
    "exp2-description":"Moussasoft est une entreprise marocaine spécialisée dans le développement web et mobile et les solutions numériques conçus pour les entreprises afin d'améliorer leur présence numérique et leur efficacité opérationnelle.",
    "exp2-contributions": "<p>- Contribué au développement de sites web en implémentant les changements demandés et corrigeant les bugs.</p><p>- Responsable du déploiement de versions testées et stables en production.</p><p>- Dirigé une petite équipe de développement, coordonnant les tâches et assurant le respect des délais.</p><p>- Assuré la qualité du code et le contrôle de version sur toutes les mises à jour.</p>",
    "exp-visit":"Visiter leur site web",
    "exp-stack":"Stack technique :",
    "exp-note":"J'ai également réalisé des projets freelance, que je préfère ne pas lister par confidentialité client et discrétion personnelle, car je ne les considère pas comme des expériences professionnelles principales.",
    "services":"Services",
    "s1":"Design graphique de logos",
    "s2":"UX/UI Web-Design + Design Mobile",
    "s3":"Développement front-end",
    "s4":"Développement front-end par Framework",
    "s5":"Développement front-end mobile",
    "s6":"Développement back-end (Natif)",
    "s7":"Développement back-end par framework",
    "s8":"Conception et gestion de bases de données",
    "s9":"DevOps et Services Cloud",
    "services-tech":"Technologies :",
    "stats": "Statistiques",
    "github-stats":"Statistiques GitHub :",
    "account-overview":"Aperçu du compte",
    "account-username":"Othman4dev",
    "total-commit":"Total commits :",
    "commit-count":"6,8k",
    "total-repos":"Nombre de dépôts :",
    "repos-count":"85",
    "total-followers":"Abonnés :",
    "followers-count":"26",
    "total-stars":"Étoiles :",
    "stars-count":"76",
    "commit-graph":"Graphique des commits",
    "more-stats":"Plus de statistiques :",
    "contact":"Contact",
    "contact-big":"N'hésitez pas à me contacter",
    "contact-small":"Je réponds immédiatement !",
    "linkedin:":"LinkedIn :",
    "email":"Email :",
    "contact-name": "Otman Kharbouch",
    "copy-email":"Copier l'email",
    "whatsapp":"WhatsApp :",
    "start-chat":"Commencer une discussion",
    "github":"GitHub :",
    "visit-profile":"Visiter le profil",
    "instagram":"Instagram :",
    "copy":"2025 Otman Kharbouch. Tous droits réservés. Conçu et développé par Otman Kharbouch.",
    "youcode":"YouCode",
    "education1-description":"<strong>YouCode</strong> est un programme transformateur de développement web de deux ans qui combine la formation front-end et back-end avec des compétences relationnelles comme le travail d'équipe et la gestion de projet. En partenariat avec UM6P et inspiré du modèle Simplon.co, il adopte une approche d'apprentissage basée sur les projets pour relever les défis du monde réel. <br /> Soutenu par OCP et connecté au réseau 1337, <strong>YouCode</strong> offre l'accès à des ressources de pointe dans un environnement dynamique. Les étudiants diplômés deviennent des professionnels confiants et prêts pour l'industrie, équipés pour le leadership technologique futur.",
    "education-program":"Programme d'études :",
    "education1-program-description":"Chez YouCode, le programme est conçu pour fournir une base complète dans le développement web front-end et back-end, ainsi que les outils et méthodologies essentiels pour le développement logiciel moderne.",
    "education1-learn":"En savoir plus sur <strong>YouCode</strong> sur",
    "tech-tools":"Technologies et outils :",
    "education1-list":"<li>Développement Front-End : HTML, CSS, JavaScript, React, Angular, Vue.js, Next.js, React Native.</li><li>Développement Back-End : PHP, Laravel, Nest.js, ExpressJs</li><li>Bases de données : MongoDB, MySQL, DynamoDB</li><li>Serveurs Web : Apache, Nginx.</li><li>Systèmes d'exploitation et scripts : Linux, Bash, CMD.</li><li>Gestion de projet : Jira, Trello</li><li>Pratiques de développement : Méthodologies agiles, contrôle de version (Git/GitHub)</li>",
    "education1-final":"En s'engageant avec cette pile diversifiée, les étudiants diplômés deviennent des développeurs polyvalents équipés pour relever les défis du monde réel et s'adapter au paysage technologique en constante évolution.",
    "e-learning":"E-learning",
    "education1-date":"2023 - 2025",
    "education2-date":"2023 - 2021",
    "education2-description":"<strong>Codecademy</strong> et <strong>FreeCodeCamp</strong> sont des plateformes leaders dans le domaine de l'e-learning, offrant des cours complets en développement web et programmation. Ces plateformes fournissent un moyen flexible et accessible d'apprendre les compétences de codage, s'adressant aux débutants comme aux apprenants avancés. <br /> <strong>Codecademy</strong> propose des leçons de codage interactives dans divers langages de programmation, notamment JavaScript, Python et HTML/CSS. Leur approche pratique garantit que les apprenants peuvent immédiatement appliquer ce qu'ils apprennent à travers des exercices pratiques et des projets. <br /> <strong>FreeCodeCamp</strong> est renommé pour son programme étendu qui couvre le développement front-end et back-end. Il met l'accent sur l'apprentissage basé sur les projets, permettant aux étudiants de construire des applications du monde réel et d'acquérir une expérience pratique. La plateforme offre également des certifications à la fin de ses cours rigoureux.",
    "education2-learn":"<span>En savoir plus sur <strong>Codecademy</strong> sur</span> <a href=\"https://www.codecademy.com\" target=\"_blank\">Codecademy</a> et <strong>FreeCodeCamp</strong> sur <a href=\"https://www.freecodecamp.org\" target=\"_blank\">FreeCodeCamp</a>",
    "education2-program-description":"Le programme pour le cours Responsive Web Design sur FreeCodeCamp et le cours JavaScript sur Codecademy est conçu pour fournir une base solide en développement web et programmation.",
    "education2-list":"<div class=\"wrap-list\"><h3 class=\"education-subtitle\">FreeCodeCamp - Responsive Web Design </h3><ul class=\"education-list\"><li>HTML de base et HTML5</li><li>CSS de base</li><li>Design visuel appliqué</li><li>Accessibilité appliquée</li><li>Principes du design web responsive</li><li>CSS Flexbox</li><li>CSS Grid</li><li>Projets de design web responsive</li>   </ul> </div> <div class=\"wrap-list\">   <h3 class=\"education-subtitle\">Codecademy - JavaScript</h3><ul class=\"education-list\"><li>Introduction à JavaScript</li><li>Syntaxe JavaScript</li><li>Fonctions</li><li>Conditionnelles, tableaux, boucles, itérateurs, objets, portée</li><li>Classes</li><li>Compatibilité navigateur et transpilation</li><li>Projets JavaScript</li></ul></div>",
    "education-final":"En s'engageant avec ces cours complets, les étudiants acquièrent les compétences nécessaires pour construire des sites web responsives et développer une maîtrise de la programmation JavaScript.",
    "loading":"Chargement",
    "dev":"En développement",
    "dev-desc":"Ce site web est continuellement <strong>en développement</strong>. Certaines fonctionnalités peuvent être incomplètes ou pas encore optimisées pour tous les appareils. Nous apprécions votre patience et votre compréhension.",
    "dev-tip":"Pour la meilleure expérience, veuillez utiliser un <strong>ordinateur</strong> ou une <strong>tablette</strong>.",
    "tuto-1":"Vous pouvez naviguer en utilisant ces flèches",
    "skip-all":"Tout ignorer ",
    "next":"Suivant ",
    "cv":"Obtenir un CV",
    "lang":"Langue",
    "offline":"Hors ligne",
    "unavailable":"Actuellement <br /> indisponible"

}
